Infineon/cmsis_packs/XMC4000/Infineon.XMC4000_DFP.pdsc
      <!-- ******************************  XMC4400-F64x512   ****************************** -->
      <device Dname="XMC4400-F64x512">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4400_series/Include/XMC4400.h"  define="XMC4400_F64x512"/>
        <debug      svd="SVD/XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4400_512.FLM"    start="0x0C000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/XMC4400c_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4400_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4400-DS-v01_02-EN.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4400_AB_Errata_Sheet-ES-v01_04-EN.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="31"/>
        <feature type="QFP"           n="64"/>      
      </device>
      
      <!-- ******************************  XMC4400-F100x256   ****************************** -->
      <device Dname="XMC4400-F100x256">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4400_series/Include/XMC4400.h"  define="XMC4400_F100x256"/>
        <debug      svd="SVD/XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4400_256.FLM"    start="0x0C000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/XMC4400c_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4400_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4400-DS-v01_02-EN.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4400_AB_Errata_Sheet-ES-v01_04-EN.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>

      <!-- ******************************  XMC4400-F64x256   ****************************** -->
      <device Dname="XMC4400-F64x256">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4400_series/Include/XMC4400.h"  define="XMC4400_F64x256"/>
        <debug      svd="SVD/XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4400_256.FLM"    start="0x0C000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/XMC4400c_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4400_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4400-DS-v01_02-EN.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4400_AB_Errata_Sheet-ES-v01_04-EN.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="31"/>
        <feature type="QFP"           n="64"/>      
      </device>
      
      <!-- ******************************  XMC4402-F100x256   ****************************** -->
      <device Dname="XMC4402-F100x256">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4400_series/Include/XMC4400.h"  define="XMC4402_F100x256"/>
        <debug      svd="SVD/XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4400_256.FLM"    start="0x0C000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/XMC4400c_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4400_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4400-DS-v01_02-EN.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4400_AB_Errata_Sheet-ES-v01_04-EN.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>   
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>
      
      <!-- ******************************  XMC4402-F64x256   ****************************** -->
      <device Dname="XMC4402-F64x256">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4400_series/Include/XMC4400.h"  define="XMC4402_F64x256"/>
        <debug      svd="SVD/XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4400_256.FLM"    start="0x0C000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/XMC4400c_256.FLM"   start="0x08000000"  size="0x40000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4400_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4400-DS-v01_02-EN.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4400_AB_Errata_Sheet-ES-v01_04-EN.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>    
        <feature type="ADC"           n="14"      m="12"/>
        <feature type="IOs"           n="31"/>
        <feature type="QFP"           n="64"/>      
      </device>
      
      </subFamily>

      <!-- ************************  Subfamily 'XMC4500'  **************************** -->
      <subFamily DsubFamily="XMC4500 Series">
        <feature type="DMA"           n="12"/>
        <feature type="ComOther"      n="6"                         name="Universal Serial Interface"/>
      
      <!-- ******************************  XMC4500-E144x1024  ****************************** -->
      <device Dname="XMC4500-E144x1024">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4500_E144x1024"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>          
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>      
        <algorithm  name="Flash/XMC4500_1024.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4500c_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="USBD"          n="1"/>  
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="91"/>
        <feature type="BGA"           n="144"/>             
      </device>

