Infineon/cmsis_packs/XMC4000/Infineon.XMC4000_DFP.pdsc
      <!-- ******************************  XMC4500-F144x1024  ****************************** -->
      <device Dname="XMC4500-F144x1024">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4500_F144x1024"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_1024.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4500c_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="USBD"          n="1"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="91"/>
        <feature type="QFP"           n="144"/>             
      </device>

      <!-- ******************************  XMC4500-F100x1024  ****************************** -->
      <device Dname="XMC4500-F100x1024">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4500_F100x1024"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_1024.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4500c_1024.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="USBD"          n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>
            
      <!-- ******************************  XMC4500-F144x768  ****************************** -->
      <device Dname="XMC4500-F144x768">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4500_F144x768"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0xC0000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_768.FLM"    start="0x0C000000"  size="0xC0000"                  default="1"/>
        <algorithm  name="Flash/XMC4500c_768.FLM"   start="0x08000000"  size="0xC0000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="USBD"          n="1"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="91"/>
        <feature type="QFP"           n="144"/>         
      </device>

      <!-- ******************************  XMC4500-F100x768  ****************************** -->
      <device Dname="XMC4500-F100x768">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4500_F100x768"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0xC0000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_768.FLM"    start="0x0C000000"  size="0xC0000"                  default="1"/>
        <algorithm  name="Flash/XMC4500c_768.FLM"   start="0x08000000"  size="0xC0000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="USBD"          n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>

      <!-- ******************************  XMC4502-F100x768  ****************************** -->
      <device Dname="XMC4502-F100x768">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4502_F100x768"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0xC0000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>     
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_768.FLM"    start="0x0C000000"  size="0xC0000"                  default="1"/>
        <algorithm  name="Flash/XMC4500c_768.FLM"   start="0x08000000"  size="0xC0000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="CAN"           n="3"/>
        <feature type="USBD"          n="1"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>

      <!-- ******************************  XMC4504-F144x512  ****************************** -->
      <device Dname="XMC4504-F144x512">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4504_F144x512"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_512.FLM"    start="0x0C000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/XMC4500c_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>   
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="91"/>
        <feature type="QFP"           n="144"/>         
      </device>

      <!-- ******************************  XMC4504-F100x512  ****************************** -->
      <device Dname="XMC4504-F100x512">
        <processor Dclock="120000000"/>
        <compile header="Device/XMC4500_series/Include/XMC4500.h"  define="XMC4504_F100x512"/>
        <debug      svd="SVD/XMC4500.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x10000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC4500_512.FLM"    start="0x0C000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/XMC4500c_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <book    name="Documents/Infineon-xmc4500_rm_v1.6_2016-UM-v01_06-EN.pdf"               title="XMC4500 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC4500-DS-v01_04-EN.pdf"               title="XMC4500 Series Data Sheet"/>
        <book    name="Documents/Infineon-XMC4500_AC_Errata_Sheet_v1_2-ES-v01_02-EN.pdf"          title="XMC4500 Series Errata Sheet"/>
        <book    name="Device/XMClib/doc/XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>    
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>         
      </device>
      
      </subFamily>
      
      <!-- ************************  Subfamily 'XMC4700'  **************************** -->
      <subFamily DsubFamily="XMC4700 Series">
        <feature type="DMA"           n="12"/>
        <feature type="CAN"           n="6"/>
        <feature type="ETH"           n="1" m="100000000" name="Integrated Ethernet MAC"/>
        <feature type="ComOther"      n="6"               name="Universal Serial Interface"/>
        <feature type="USBD"          n="1"/>          
      
      <!-- ******************************  XMC4700-E196x2048  ****************************** -->
      <device Dname="XMC4700-E196x2048">
        <processor Dclock="144000000"/>
        <compile header="Device/XMC4700_series/Include/XMC4700.h"  define="XMC4700_E196x2048"/>
        <debug      svd="SVD/XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>  
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>       
        <algorithm  name="Flash/XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash/XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents/Infineon-ReferenceManual_XMC4700_XMC4800-UM-v01_03-EN.pdf"                   title="XMC4700 Series Reference Manual"/>
        <book    name="Documents/xmc4700_xmc4800__ds_v1.0_2016_01.pdf"           title="XMC4700 Series Data Sheet"/>       
        <book    name="Documents/XMC4700_XMC4800_AA_Errata_Sheet_v1_1.pdf"       title="XMC4700 AB Errata Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
      </device>   

