Infineon/cmsis_packs/XMC4000/Infineon.XMC4000_DFP.pdsc
    <condition id="XMC4500_GCC">                                     
      <description>Infineon XMC4500 series</description>
      <accept condition="XMC4500_F144"/>
      <accept condition="XMC4500_F100"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4500_1024_GCC">                                     
      <description>Infineon XMC4500 series 1024K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-*x1024"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4500_768_GCC">                                     
      <description>Infineon XMC4500 series 768K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-*x768"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4502_GCC">                                     
      <description>Infineon XMC4502 series</description>
      <accept condition="XMC4502_F100"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4502_768_GCC">                                     
      <description>Infineon XMC4502 series 768K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4502-*x768"/>
      <require Tcompiler="GCC"/>
    </condition>
  
    <condition id="XMC4504_GCC">                                     
      <description>Infineon XMC4504xseries</description>
      <accept condition="XMC4504_F100"/>
      <accept condition="XMC4504_F144"/>
      <require Tcompiler="GCC"/>
    </condition>  

    <condition id="XMC4504_512_GCC">                                     
      <description>Infineon XMC4504 series 768K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC4504-*x512"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC4500_IAR">                                     
      <description>Infineon XMC4500 series</description>
      <accept condition="XMC4500_F144"/>
      <accept condition="XMC4500_F100"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4502_IAR">                                     
      <description>Infineon XMC4502 series</description>
      <accept condition="XMC4502_F100"/>
      <require Tcompiler="IAR"/>
    </condition>
  
    <condition id="XMC4504_IAR">                                     
      <description>Infineon XMC4504xseries</description>
      <accept condition="XMC4504_F100"/>
      <accept condition="XMC4504_F144"/>
      <require Tcompiler="IAR"/>
    </condition>  
  
    <condition id="XMC45xx">                                     
      <description>Infineon XMC45xx series</description>
      <accept condition="XMC4500_F144"/>
      <accept condition="XMC4500_F100"/>
      <accept condition="XMC4502_F100"/>
      <accept condition="XMC4504_F100"/>
      <accept condition="XMC4504_F144"/>
    </condition>

    <condition id="XMC4700_E196">                                     
      <description>Infineon XMC4700 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-E196*"/>
    </condition>
    
    <condition id="XMC4700_F144">                                     
      <description>Infineon XMC4700 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F144*"/>
    </condition>

    <condition id="XMC4700_F100">                                     
      <description>Infineon XMC4700 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F100*"/>
    </condition>
    
    <condition id="XMC47xx">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
    </condition>

    <condition id="XMC47xx_ARMCC">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="ARMCC"/>      
    </condition>

    <condition id="XMC47xx_GCC">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="GCC"/>     
    </condition>

    <condition id="XMC47xx_2048_GCC">                                     
      <description>Infineon XMC47xx series 2048K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC47??-*x2048"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC47xx_1536_GCC">                                     
      <description>Infineon XMC47xx series 1536K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC47??-*x1536"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC47xx_IAR">                                     
      <description>Infineon XMC47xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="XMC4800_E196">                                     
      <description>Infineon XMC4800 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-E196*"/>
    </condition>    

    <condition id="XMC4800_F144">                                     
      <description>Infineon XMC4800 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F144*"/>
    </condition>

    <condition id="XMC4800_F100">                                     
      <description>Infineon XMC4800 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F100*"/>
    </condition>
    
    <condition id="XMC48xx">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
    </condition>

    <condition id="XMC48xx_ARMCC">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC48xx_GCC">                                     
      <description>Infineon XMC48xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC48xx_2048_GCC">                                     
      <description>Infineon XMC48xx series 2048K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC48??-*x2048"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC48xx_1536_GCC">                                     
      <description>Infineon XMC48xx series 1536K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC48??-*x1536"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="XMC48xx_1024_GCC">                                     
      <description>Infineon XMC48xx series 1024K flash</description>
      <require Dvendor="Infineon:7" Dname="XMC48??-*x1024"/>
      <require Tcompiler="GCC"/>
    </condition>

