Infineon/cmsis_packs/XMC4000/Infineon.XMC4000_DFP.pdsc
    <condition id="XMC4 CMSIS Driver CAN">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC43xx"/>      
      <accept  condition="XMC42xx"/>
      <accept  condition="XMC4100_F64"/>
      <accept  condition="XMC4100_Q48"/>
      <accept  condition="XMC4108_F64"/>
      <accept  condition="XMC4108_Q48"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>         
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="CAN"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver MCI">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver MCI</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <accept  condition="XMC4504_F144"/>
      <accept  condition="XMC4504_F100"/>
      <accept  condition="XMC43xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>         
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SDMMC"/>
    </condition>    

    <condition id="XMC4 HAL GPIO">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>          
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />    
    </condition>

    <condition id="XMC4 HAL SCU GPIO ERU">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>          
      <require Cclass ="Device" Cgroup="XMClib" Csub="SCU" />    
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />    
      <require Cclass ="Device" Cgroup="XMClib" Csub="ERU" />    
    </condition>

    <condition id="XMC4 HAL VADC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>   
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />               
      <require Cclass ="Device" Cgroup="XMClib" Csub="VADC" />    
    </condition>
    
</conditions>

  <examples>
    <!-- Infineon XMC4200 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4200 Application Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>

    <!-- Infineon XMC4300 Relax Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4300 Relax Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example> 

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4300 Relax Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4300 Relax Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example> 
    
    <!-- Infineon XMC4400 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Middleware/USB/Device/VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <example name="Network HTTP Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Middleware/Network/HTTP_Server" version="1.0.0">
      <description> HTTP Server using MDK-Professional Middleware</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>   
      </attributes>
    </example>  

    <example name="Network Telnet Server" doc="Abstract.txt" folder="Boards/Infineon/XMC4400 Application Kit/Middleware/Network/Telnet_Server" version="1.0.0">
      <description> Telnet Server using MDK-Professional Middleware</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>    
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>   
      </attributes>
    </example>  

    <!-- Infineon XMC4500 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC4500 Application Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  

